-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 58.239.58.243    Database: java503_team2
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `place`
--

DROP TABLE IF EXISTS `place`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `place` (
  `place_idx` int NOT NULL AUTO_INCREMENT COMMENT 'where_idx',
  `location` varchar(45) DEFAULT NULL COMMENT '주소(특정 구)/ 삭제 예정',
  `address` varchar(200) DEFAULT NULL COMMENT '세부 주소',
  `name` varchar(45) DEFAULT NULL COMMENT '장소 이름',
  `recommend_age` varchar(45) DEFAULT NULL COMMENT '최소 나이',
  `number_people` int DEFAULT '1' COMMENT '최소 인원',
  `open_time` varchar(45) DEFAULT NULL COMMENT '개점 시간',
  `close_time` varchar(45) DEFAULT NULL COMMENT '폐점 시간',
  `phone` varchar(45) DEFAULT NULL COMMENT '매장 연락처',
  `category` varchar(200) DEFAULT NULL COMMENT '카테고리',
  PRIMARY KEY (`place_idx`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='장소';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `place`
--

LOCK TABLES `place` WRITE;
/*!40000 ALTER TABLE `place` DISABLE KEYS */;
INSERT INTO `place` VALUES (1,'부산진구','중앙대로 691번길 54 2층 이스케이프탑','이스케이프탑 부산점','10',2,'12:00','22:00','0507-1418-1111','방탈출'),(2,'부산진구','중앙대로 680번가길 9 3층','룸즈에이 서면점','10',2,'10:00','24:00','0507-1426-4147','방탈출'),(3,'부산진구','중앙대로 692번길 38 은아빌딩 5층','덤앤더머 방탈출카페 서면점','10',2,'13:00','22:00','0507-1354-4466','방탈출'),(4,'부산진구','서전로 10번길 50 4층','홀릭 보드게임카페','10',2,'12:00','04:00','0507-1381-7771','보드게임'),(6,'부산진구','중앙대로 672 삼정타워 7층','챔피언 삼정타워 서면점','1',2,'11:00','20:45','051-808-0870','키즈카페'),(7,'부산진구','서전로 10번길 69 2층','데블다이스 보드게임 카페','10',2,'12:00','01:00','0507-1412-3912','보드게임'),(8,'부산진구','가야대로 772 에비뉴엘관 지하 2층','챔피언 롯데백화점 부산본점','1',2,'10:30','19:30','051-810-4012','키즈카페'),(9,'부산진구','서전로 10번길 61 쥬디스태화 신관 6층','레이저 아레나','20',2,'11:00','22:00','0507-1341-4273','서바이벌'),(10,'부산진구','중앙대로 672 삼정타워 10층','런닝맨 부산점','10',2,'11:00','22:00','0507-1341-4273','테마파크'),(11,'부산진구','동천로 70 3층','마리앤쥬','20',2,'12:00','21:00','0507-1311-0220','동물카페'),(12,'부산진구','중앙대로 672 삼정타워 10층','다이나믹 메이즈','10',2,'11:00','20:00','051-520-3636','테마파크'),(14,'부산진구','중앙대로 679-5','반지마을 서면일번가점','10',2,'10:30','19:30','051-806-1915','공방'),(17,'부산진구','중앙대로 680번가길 47 3,4층','세븐스타코인노래연습장 서면점','10',1,'12:00','01:00','051-816-7777','코인노래방'),(20,'기장군','기장읍 기장해안로 205','스카이라인루지 부산','10',2,'10:00','18:30','051-722-6002','루지'),(21,'기장군','기장읍 동부산관광로 42','롯데월드 어드벤처 부산','10',2,'10:00','19:00','1661-2000 ','테마파크'),(23,'부산진구','전포대로 162 한웅인터비 2층','돌멩이 클라이밍','20',1,'10:00','22:30','010-8380-4799','클라이밍'),(25,'부산진구','중앙대로 692번길 46 지하 1층','드림 메이드카페','10',2,'13:00','22:00','0507-1498-0071','메이드집사'),(26,'부산진구','중앙대로 680번가길 47 2층','클로버 집사카페','10',2,'14:00','22:00','0507-1357-0115','메이드집사'),(27,'부산진구','부전로 57 3층','로얄볼링장','20',2,'14:00','03:00','0507-1365-0644','볼링장'),(28,'부산진구','동천로 95번길 13 5층','더블업 홀덤펍 서면점','20',2,'19:00','06:00','0507-1346-9326','홀덤펍'),(31,'기장군','정관읍 정관8로 28 6층','더네오 정관점','10',2,'00:00','24:00','0507-1428-4540','멀티방'),(32,'부산진구','부산 부산진구 가야대로 734','부산영어도서관','1',1,'09:00','18:00','051-818-2800','도서관'),(33,'수영구','부산 수영구 광안해변로 175 1층','인생네컷 광안오션점','10',2,'00:00','00:00','0507-1331-7205','무인스튜디오'),(34,'수영구','부산 수영구 광안로61번길 60 이안테라디움 103호','하루필름 광안리점','10',2,'00:00','00:00','0507-1321-5784','무인스튜디오'),(35,'수영구','부산 수영구 광안해변로277번길 61 1층','베이킹스튜디오피낭시에','10',2,'10:00','22:00','0507-1383-5872','베이킹체험'),(36,'북구','부산 북구 백양대로1124번길 94 1층','정미화제과기능장의베이킹클래스','10',2,'09:00','22:00','0507-1469-1514','베이킹체험'),(38,'남구','부산 남구 동명로132번길 18','레포츠911','20',2,'00:00','00:00','0507-1436-5522','서바이벌'),(39,'중구','부산 중구 광복로 88 2층 208호 아임슬라임카페 남포점','아임슬라임카페 남포점','1',2,'14:00','19:00','0507-1397-3343','슬라임카페'),(40,'동래구','부산 동래구 안남로 98 2층 꼬물꼬물블럭','꼬물꼬물토탈공방','1',2,'14:00','18:00','0507-1442-0983','슬라임카페'),(41,'영도구','부산 영도구 태종로836번길 55','태종대 오션플라잉 테마파크','20',2,'09:00','18:00','051-404-0219','짚라인'),(42,'기장군','부산 기장군 일광읍 해빛4로 35 7층','하이리페움 아이스포츠파크','1',2,'11:00','20:00','051-724-9998','키즈카페'),(43,'강서구','부산 강서구 명지국제1로 60-1 7층, 8층','몬스터파크 부산명지점','1',2,'11:00','20:00','0507-1381-9775','키즈카페'),(47,'수영구','부산 수영구 광안해변로 237 6층','세븐테마카페 본점','20',2,'11:30','21:30','0507-1313-3672','동물카페'),(48,'사하구','부산 사하구 낙동대로 245 3층','해피패럿','20',2,'11:00','17:00','0507-1424-0221','동물카페'),(49,'부산진구','부산 부산진구 동천로85번길 7 3층','부산 파티룸 모노 컨텐츠룸','20',2,'11:00','23:00','0507-1330-6236','파티룸'),(50,'수영구','부산 수영구 남천바다로 18 3층','르프프 파티룸 광안리','20',2,'09:00','24:00','0507-1343-0326','파티룸'),(52,'부산진구','부산 부산진구 중앙대로680번가길 29 4층','제트엔댄스스튜디오 부산점','20',1,'10:00','22:00','051-802-8885','댄스학원'),(53,'부산진구','부산 부산진구 중앙대로680번가길 29 3층','카타르시스 이스케이프','10',2,'10:30','24:00','0507-1467-3360','방탈출'),(54,'부산진구','부산 부산진구 동성로87번길 14 2층','반지공방 메이드인러브','10',2,'11:00','22:00','0507-1350-1985','공방'),(55,'수영구','부산 수영구 민락로33번길 7 2층 포레오르','포레오르','10',2,'10:00','19:00','0507-1437-2271','공방'),(56,'수영구','부산 수영구 남천바다로9번길 31 1층 Moi Cher','모아쉘','10',2,'11:00','19:00','0507-1357-6934','공방'),(57,'수영구','부산 수영구 광안로 49-1 상생빌딩 4층','헤즈업 홀덤펍','20',2,'18:00','06:00','0507-1323-6662','홀덤펍'),(58,'남구','부산 남구 용소로13번길 30 2층','더블업홀덤펍 경성대점','20',2,'18:00','06:00','0507-1496-1389','홀덤펍'),(59,'해운대구','부산 해운대구 세실로69번길 15 4층 402호, 403호','티오피홀덤펍','20',2,'18:30','05:00','010-8767-1692','홀덤펍'),(60,'해운대구','부산 해운대구 달맞이길117번가길 175 1층 105호','공간 노스텔지어 파티룸 스튜디오 부산','20',2,'10:00','23:00','0507-1362-9951','파티룸'),(61,'해운대구','부산 해운대구 구남로 37 라비드아틀란 3108호','파티룸펜타클','20',2,'00:00','24:00','0507-1362-9986','파티룸'),(62,'기장군','부산 기장군 장안읍 장안로 211 안데르센극장','안데르센 동화마을','10',2,'09:00','18:00','0507-1354-4761','테마파크'),(63,'부산진구','부산 부산진구 서전로 11 3층','블루댄스','20',1,'10:00','22:00','0507-1318-8248','댄스학원'),(64,'남구','부산 남구 용소로 18 용소빌딩 6층','헤이데이댄스아카데미','20',1,'14:30','22:30','051-611-2194','댄스학원'),(65,'동래구','부산 동래구 중앙대로1335번길 43 나무공원빌딩 3층','더 코드 댄스 스튜디오','20',1,'16:30','22:30','0507-1308-0561','댄스학원'),(66,'사하구','부산 사하구 낙동대로 498 초이스타워 2층','오터클라이밍','20',1,'12:00','22:00','0507-1389-5158','클라이밍'),(67,'수영구','부산 수영구 장대골로 41','웨이브락 클라이밍 광안리점','20',1,'12:00','22:30','0507-1416-4226','클라이밍'),(68,'사상구','부산 사상구 학감대로252번길 59 2층','클럽 스파이더 클라이밍 사상점','20',1,'13:00','22:00','010-4108-7055','클라이밍'),(69,'중구','부산 중구 망양로193번길 146','부산광역시립 중앙도서관','1',1,'09:00','22:00','051-250-0300','도서관'),(70,'금정구','부산 금정구 기찰로 94','부산광역시 금샘도서관','1',1,'09:00','22:00','051-519-5900','도서관'),(71,'사하구','부산 사하구 낙동대로 474 지하1층 나인싱어동전노래연습장','나인싱어동전노래방','10',1,'00:00','24:00','010-7631-2395','코인노래방'),(72,'수영구','부산 수영구 수영로 709 3층','아이콘코인노래방 수영점','10',1,'00:00','24:00','0507-1462-0946','코인노래방'),(73,'해운대구','부산 해운대구 구남로 29','아이코인노래연습장','10',1,'00:00','24:00',NULL,'코인노래방'),(74,'서구','부산 서구 대티로 159 협성르네상스 3층 301호','폴인캣츠','20',2,'12:00','19:00','0507-1352-7755','동물카페'),(75,'여수시','전남 여수시 돌산읍 강남로 11 24F 짚트랙','라마다해상짚트랙','20',2,'10:00','18:00','061-644-9500','짚라인'),(76,'문경시','경북 문경시 불정길 174','짚라인문경','20',2,'09:00','17:00','02-1588-5219','짚라인'),(77,'가평군','경기 가평군 가평읍 경반안로 417-11 브릿지 짚라인','브릿지짚라인','20',2,'09:00','18:00','031-581-7335','짚라인'),(78,'여수','전남 여수시 소라면 안심산길 155','여수 유월드 루지 테마파크','10',2,'10:00','19:00','061-810-6000','루지'),(79,'경주','경북 경주시 천북남로 16','경주루지월드','10',2,'09:30','20:00','0507-1323-6939','루지'),(80,'통영','경남 통영시 발개로 178','스카이라인루지 통영','10',2,'10:00','18:00','1522-2468','루지'),(81,'부산진구','부산 부산진구 중앙대로692번길 21 2층','메이드문 메이드카페 서면','10',2,'14:00','21:00','0507-1459-9871','메이드집사'),(82,'서울','서울 마포구 어울마당로 92 2층','오마이 집사카페 프린세스왕국점','10',2,'10:00','22:00','0507-1373-1646','메이드집사'),(83,'서울','서울 강남구 테헤란로1길 20 3층,4층','더박스 멀티방룸카페','10',2,'11:00','23:00','02-566-6761','멀티방'),(84,'서울','서울 마포구 홍익로5길 13 동신빌딩 5층','멀티플러스 홍대점','10',2,'12:00','23:00','0507-1339-7804','멀티방'),(85,'인천','인천 연수구 인천타워대로132번길 30 휴먼빌파크상가 501호','MOL멀티룸','10',2,'10:00','22:00','0507-1416-3047','멀티방'),(86,'부산진구','부산 부산진구 중앙대로680번가길 45 1, 2층','플랜비스튜디오 서면점','10',2,'00:00','24:00','051-1577-4380','무인스튜디오'),(87,'부산진구','부산 부산진구 서전로10번길 61 1층 101호, 쥬디스태화신관1층','포토시그니처 서면점','10',2,'00:00','24:00','0507-1320-9389','무인스튜디오'),(88,'서구','부산 서구 구덕로334번길 5 1층','더말랑','1',2,'11:00','21:00','0507-1358-5608','슬라임카페'),(89,'중구','부산 중구 광복로39번길 6','슬라임월드','1',2,'11:00','21:00',NULL,'슬라임카페'),(90,'사상구','부산 사상구 낙동대로 1212','포시즌레벤트','20',2,'09:00','18:00','051-553-8007','서바이벌'),(91,'북구','부산 북구 덕천로380번길 15','좋은서바이벌','20',2,'00:00','24:00','010-3868-0897','서바이벌'),(92,'동래구','부산 동래구 명륜로129번길 20','메가 락볼링장','10',2,'11:00','06:00','051-555-5925','볼링장'),(93,'부산진구','부산 부산진구 중앙대로702번길 43 2층','킴스볼링장 1호점','10',2,'12:00','04:00','051-818-5586','볼링장'),(94,'부산진구','부산 부산진구 범일로 181 사학연금회관 16, 17층','뷰 볼링장','10',2,'13:00','01:00','051-637-0163','볼링장'),(95,'부산진구','부산 부산진구 동천로 63 4층 레드버튼','보드게임카페 레드버튼 서면점','10',2,'13:00','24:00','0507-1335-3799','보드게임'),(96,'부산진구','부산 부산진구 중앙대로692번길 37 3층 보드게임카페 홈즈앤루팡 서면점','홈즈앤루팡 보드게임카페 서면점','10',2,'13:00','24:00','0507-1376-3512','보드게임'),(97,'부산진구','부산 부산진구 서전로57번길 38 2층 디무아','디무아 베이킹스튜디오','10',2,'00:00','24:00',NULL,'베이킹체험'),(98,'부산진구','부산 부산진구 양지로17번길 62 1층 조안나베이킹스튜디오','조안나베이킹스튜디오 부산점','10',2,'10:00','22:00','0507-1346-1836','베이킹체험'),(120,'부산진구','부산 해운대구 센텀4로 15 센텀시티몰 4층','키자니아 부산','1',2,'09:00','19:30','1544-5110','키자니아'),(121,'해운대구','부산 해운대구 APEC로 55','벡스코','10',2,'10:00','22:00','051-740-7300','컨벤션'),(122,'해운대구','부산 해운대구 해운대해변로 287 3층 303, 304호','MCT 슈팅클럽','20',1,'14:00','23:00','0507-1423-1157','실내사격'),(123,'제주','제주 제주시 조천읍 와흘상서2길 47 제주레포츠랜드','제주레포츠랜드','20',2,'09:00','17:30','064-784-8800','카트장'),(124,'제주','제주 제주시 조천읍 조함해안로 519-10','제주해양레저파크','20',2,'09:00','18:00','010-4797-1717','패러세일링'),(125,'충주','충북 충주시 앙성면 단암길 19','스카이다이빙센터 충주','20',1,NULL,NULL,NULL,'스카이다이빙'),(126,'서울','서울 성동구 서울숲4길 18-5 1층','맥썸','20',2,'10:00','22:00','','틱톡부스'),(127,'수영구','부산 수영구 광남로48번길 29 1층 크레이지서퍼스','크레이지서퍼스 광안리 본점','20',1,'08:30','19:00','0507-1343-9804','서핑');
/*!40000 ALTER TABLE `place` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-02-25 15:30:37
